{
	"name":"Danny Chapman",
	"description":"Web designer and Open Government Fanboy Danny Chapman",
	"url":"http://localhost:4000",
	"updated":"",
	"posts":[
	{
		"title":"Government and design are not mutually exclusive",
		"id":"/2013/06/10/government-design",
		"url":"http://localhost:4000/2013/06/10/government-design/",
		"description":"",
		"tags": "Open Source, Design, Government",
		"categories":"Announcements",
		"date": "2013-06-10 00:00:00 -0400",
		"content": "<p>High school students, recent college graduates, moms, professors, part time bloggers. All rolling up sleeves to build something for their city. Scenes like this have played out at hackathons before, and while the results of a hackathon might not always be as finished or as polished as we’d like, the code is not what is important. At their best, hackathons can provide a small cultural shift towards engagement fixing our democratic insititutions — a much bigger deal.</p><p>As a designer working on government-related things for the past eight years, I’ve waded elbows deep into fixing government processes online. The difference between private sector and public sector engagement is large, but the gap is closing and there are significant signs of hope.</p><p>Last year, the White House released the <a href='http://www.whitehouse.gov/sites/default/files/omb/egov/digital-government/digital-government.html'>White House Digital Strategy</a> — a document that clearly identifies the critical role design will play in the interaction between citizens and their government. Responsive design, device-agnostic approaches, and a significant focus on mobile are all called out directly. Think about that for a second: responsive design in a government document. This year, The executive branch’s Open Data Policy was published not on government servers, but on GitHub. Not only that, the first commit, or edit to this document was a design improvement to my initial design. Citizen to government collaboration, happening in a way that is transparent, open and available for everyone. This is effectively like turning on &#8220;track changes&#8221; in a living, government document. A design edit to a policy document hardly represents wholesale change in our democracy, but it is a start.</p><p>The technology is no longer the challenge, as the tools we have at our disposal are many. <a href='http://git-scm.com/'>Git</a> and git hosting providers like <a href='http://www.github.com/'>GitHub</a> for <a href='http://www.ted.com/talks/clay_shirky_how_the_internet_will_one_day_transform_government.html'>decentralized collaboration</a>, HTML5 and CSS3 for accessible device-agnostic content, smartphone adoption for bridging our broadband gap are just a small part of the toolchest.</p><p>The challenge is more fundamental — how do we as citizens engage, <a href='http://www.ted.com/talks/jennifer_pahlka_coding_a_better_government.html'>not just on election day</a>, but in the far less sexy process of governing? <a href='http://www.dobt.co/blog/'>Big, messy problems</a> are out there, but good design can and will provide a significant part of the solution. We just have to be willing to get our hands a little bit dirty and engage. Yesterday, I was inspired to see a fantastic cross-section of citizens do just that at a <a href='https://twitter.com/search?q=%23hacknwk'>Hackathon in Newark, NJ</a>. While a hackathon is just a one-day event that can’t bring about fundamental change, it can spark something. If the citizens I saw rolling up their sleeves yesterday are anything to go by, we are in for something good over the next few years.</p>"
	}
	]
}