{
	"name":"Danny Chapman",
	"description":"Web designer and Open Government Fanboy Danny Chapman",
	"url":"http://localhost:4000",
	"updated":"",
	"posts":[
	{
		"title":"Makers of things and makers of Government",
		"id":"/2013/07/01/makers-of-things",
		"url":"http://localhost:4000/2013/07/01/makers-of-things/",
		"description":"",
		"tags": "Open Source, Design, Government",
		"categories":"current",
		"date": "2013-07-01 00:00:00 -0400",
		"content": "<p>Make no mistake, there is good work to be done redesigning our online and in-person user experiences with government. The problem is, design cannot fundamentally change the experience we have with it. A better designed form is good, but it can&#8217;t change the questions on the form, or the number of times you have to line up in a government building. There are limits to how much improvement we can make if we don&#8217;t make structural changes to our lawmaking process and the government processes that result.</p><p>Typically, there is a significant divide between the process of creating laws and implementing them. Not only in the actual policy decisions at hand, but conceptually — how will the way this new rule is crafted affect the way we interact with it? Well-intentioned but badly designed legislation can and does have disastrous consequences.</p><p>Our highest volume interactions with government get the most scrutiny from this perspective, and rightly so. Voting and long lines at the DMV are among our favorite talking points. We complain, pressure collectively for improvement, and once successful, we walk away. In other less frequent or critical interactions with government, we usually <em>expect</em> a bad experience, then do little to change it. Often, we blame the government employee responsible for holding the hoops we have to jump through, rather than the people who created the hoops in the first place.</p><p>I don&#8217;t have a solution, I just want to pose a question: What would it be like if our legislative bodies were more balanced between lawyers and people who make things we interact with every day - designers, entrepreneurs and engineers? <a href='http://www.businessweek.com/articles/2013-01-10/the-113th-congress-by-the-numbers'>A fascinating chart published by Business Week</a> breaks down the 113th congress by profession. Some highlights:</p><ul><li><strong>173</strong> lawyers</li><li><strong>130</strong> businesspeople</li><li><strong>64</strong> career politicians and government employees</li></ul><p>All told, that&#8217;s 367 out of 535 voting members, or 69% of congress made of up of legislative pros, not by makers of things.</p><p>The question is a simple one: What if the lawmaking process was more reflective of us, and driven not just by societal and public policy outcomes, but by the user experience actual citizens have?</p>"
	},
	{
		"title":"Government and design are not mutually exclusive",
		"id":"/2013/06/10/government-design",
		"url":"http://localhost:4000/2013/06/10/government-design/",
		"description":"",
		"tags": "Open Source, Design, Government",
		"categories":"past",
		"date": "2013-06-10 00:00:00 -0400",
		"content": "<p>As a designer working on government-related things for the past eight years, I’ve waded elbows deep into fixing government processes online. The difference between private sector and public sector engagement is large, but the gap is closing.</p><p>Last year, the White House released the <a href='http://www.whitehouse.gov/sites/default/files/omb/egov/digital-government/digital-government.html'>White House Digital Strategy</a> — a document that clearly identifies the critical role design will play in the interaction between citizens and their government. Responsive design, device-agnostic approaches, and a significant focus on mobile are all called out directly. Think about that for a second: responsive design in a government document. This year, the executive branch’s <a href='http://project-open-data.github.io/'>Open Data Policy</a> Open Data Policy was published not on government servers, but on GitHub. Not only that, one of the <a href='https://github.com/project-open-data/project-open-data.github.io/pull/13'>first commits</a>, or edits to this document was an improvement to my initial design. This is citizen to government collaboration, happening in a way that is transparent, open and available for everyone. Effectively, this is like turning on &#8220;track changes&#8221; for a living, government document. A design edit to a policy document may not represent wholesale change in our democracy, but it is a start.</p><p>The technology is no longer the challenge, as the tools we have at our disposal are many. <a href='http://git-scm.com/'>Git</a> and git hosting providers like <a href='http://www.github.com/'>GitHub</a> for <a href='http://www.ted.com/talks/clay_shirky_how_the_internet_will_one_day_transform_government.html'>decentralized collaboration</a>, HTML5 and CSS3 for accessible device-agnostic content, and smart phone adoption for bridging our broadband gap are just a small part of the tool chest.</p><p>The challenge is more fundamental — how do we as citizens engage, <a href='http://www.ted.com/talks/jennifer_pahlka_coding_a_better_government.html'>not just on election day</a>, but in the far less sexy process of governing? <a href='http://www.dobt.co/blog/'>Big, messy problems</a> are out there, but good design can, and will, provide a significant part of the solution. We just have to be willing to get our hands a little bit dirty.</p><p>This past Sunday, I was inspired to see a fantastic cross-section of citizens do just that at a <a href='https://twitter.com/search?q=%23hacknwk'>Hackathon in Newark, NJ</a>. While a hackathon is just a one-day event that can’t bring about fundamental change, it can spark something. The results might not be as finished or as polished as we’d like, in the end the code is not what is important. Hackathons can help fuel a cultural shift towards engagement, towards fixing our democratic institutions — and that is a much bigger deal than perfect code. If the citizens I saw rolling up their sleeves this past weekend are anything to go by, we are in for something good over the next few years.</p>"
	}
	]
}